#### Terragrunt Format and Style 🖌 `success`
#### Terragrunt Initialization ⚙️ `success`
#### Terragrunt Validation 🤖 `success`
#### Terragrunt Plan 📖 `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_subnet_group.database[0] will be created
  + resource "aws_db_subnet_group" "database" {
      + arn                     = (known after apply)
      + description             = "Database subnet group for test-dev-VPC"
      + id                      = (known after apply)
      + name                    = "test-dev-db-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-db-group"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all                = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-db-group"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all               = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-default"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all               = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-default"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-us-east-1a"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all             = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-us-east-1a"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + vpc                  = true
    }

  # aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-us-east-1a"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all             = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-us-east-1a"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
    }

  # aws_network_acl.database[0] will be created
  + resource "aws_network_acl" "database" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-db"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all   = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-db"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + vpc_id     = (known after apply)
    }

  # aws_network_acl.private[0] will be created
  + resource "aws_network_acl" "private" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-private"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all   = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-private"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + vpc_id     = (known after apply)
    }

  # aws_network_acl.public[0] will be created
  + resource "aws_network_acl" "public" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-public"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all   = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-public"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + vpc_id     = (known after apply)
    }

  # aws_network_acl_rule.database_inbound[0] will be created
  + resource "aws_network_acl_rule" "database_inbound" {
      + cidr_block     = "172.17.0.0/16"
      + egress         = false
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # aws_network_acl_rule.database_outbound[0] will be created
  + resource "aws_network_acl_rule" "database_outbound" {
      + cidr_block     = "172.17.0.0/16"
      + egress         = true
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # aws_network_acl_rule.private_inbound[0] will be created
  + resource "aws_network_acl_rule" "private_inbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 80
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 80
    }

  # aws_network_acl_rule.private_inbound[1] will be created
  + resource "aws_network_acl_rule" "private_inbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 110
      + to_port        = 443
    }

  # aws_network_acl_rule.private_inbound[2] will be created
  + resource "aws_network_acl_rule" "private_inbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 53
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "udp"
      + rule_action    = "allow"
      + rule_number    = 800
      + to_port        = 53
    }

  # aws_network_acl_rule.private_inbound[3] will be created
  + resource "aws_network_acl_rule" "private_inbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + icmp_code      = -1
      + icmp_type      = 8
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "icmp"
      + rule_action    = "allow"
      + rule_number    = 820
    }

  # aws_network_acl_rule.private_inbound[4] will be created
  + resource "aws_network_acl_rule" "private_inbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 830
      + to_port        = 65535
    }

  # aws_network_acl_rule.private_inbound[5] will be created
  + resource "aws_network_acl_rule" "private_inbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "udp"
      + rule_action    = "allow"
      + rule_number    = 840
      + to_port        = 65535
    }

  # aws_network_acl_rule.private_inbound[6] will be created
  + resource "aws_network_acl_rule" "private_inbound" {
      + cidr_block     = "172.17.0.0/16"
      + egress         = false
      + from_port      = 22
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 200
      + to_port        = 22
    }

  # aws_network_acl_rule.private_inbound[7] will be created
  + resource "aws_network_acl_rule" "private_inbound" {
      + cidr_block     = "172.17.0.0/16"
      + egress         = false
      + from_port      = 5432
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 210
      + to_port        = 5432
    }

  # aws_network_acl_rule.private_inbound[8] will be created
  + resource "aws_network_acl_rule" "private_inbound" {
      + cidr_block     = "172.17.0.0/16"
      + egress         = false
      + from_port      = 8443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 220
      + to_port        = 8443
    }

  # aws_network_acl_rule.private_inbound[9] will be created
  + resource "aws_network_acl_rule" "private_inbound" {
      + cidr_block     = "172.17.0.0/16"
      + egress         = false
      + from_port      = 25
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 230
      + to_port        = 25
    }

  # aws_network_acl_rule.private_inbound[10] will be created
  + resource "aws_network_acl_rule" "private_inbound" {
      + cidr_block     = "82.196.6.227/32"
      + egress         = false
      + from_port      = 22
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 240
      + to_port        = 22
    }

  # aws_network_acl_rule.private_outbound[0] will be created
  + resource "aws_network_acl_rule" "private_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 80
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 80
    }

  # aws_network_acl_rule.private_outbound[1] will be created
  + resource "aws_network_acl_rule" "private_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 110
      + to_port        = 443
    }

  # aws_network_acl_rule.private_outbound[2] will be created
  + resource "aws_network_acl_rule" "private_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 53
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "udp"
      + rule_action    = "allow"
      + rule_number    = 800
      + to_port        = 53
    }

  # aws_network_acl_rule.private_outbound[3] will be created
  + resource "aws_network_acl_rule" "private_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 123
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "udp"
      + rule_action    = "allow"
      + rule_number    = 810
      + to_port        = 123
    }

  # aws_network_acl_rule.private_outbound[4] will be created
  + resource "aws_network_acl_rule" "private_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + icmp_code      = -1
      + icmp_type      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "icmp"
      + rule_action    = "allow"
      + rule_number    = 820
    }

  # aws_network_acl_rule.private_outbound[5] will be created
  + resource "aws_network_acl_rule" "private_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 830
      + to_port        = 65535
    }

  # aws_network_acl_rule.private_outbound[6] will be created
  + resource "aws_network_acl_rule" "private_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "udp"
      + rule_action    = "allow"
      + rule_number    = 840
      + to_port        = 65535
    }

  # aws_network_acl_rule.private_outbound[7] will be created
  + resource "aws_network_acl_rule" "private_outbound" {
      + cidr_block     = "172.17.0.0/16"
      + egress         = true
      + from_port      = 5432
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 200
      + to_port        = 5432
    }

  # aws_network_acl_rule.private_outbound[8] will be created
  + resource "aws_network_acl_rule" "private_outbound" {
      + cidr_block     = "172.17.0.0/16"
      + egress         = true
      + from_port      = 8443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 210
      + to_port        = 8443
    }

  # aws_network_acl_rule.private_outbound[9] will be created
  + resource "aws_network_acl_rule" "private_outbound" {
      + cidr_block     = "172.17.0.0/16"
      + egress         = true
      + from_port      = 25
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 220
      + to_port        = 25
    }

  # aws_network_acl_rule.private_outbound[10] will be created
  + resource "aws_network_acl_rule" "private_outbound" {
      + cidr_block     = "172.17.0.0/16"
      + egress         = true
      + from_port      = 22
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 230
      + to_port        = 22
    }

  # aws_network_acl_rule.private_outbound[11] will be created
  + resource "aws_network_acl_rule" "private_outbound" {
      + cidr_block     = "82.196.6.227/32"
      + egress         = true
      + from_port      = 22
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 240
      + to_port        = 22
    }

  # aws_network_acl_rule.public_inbound[0] will be created
  + resource "aws_network_acl_rule" "public_inbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 80
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 80
    }

  # aws_network_acl_rule.public_inbound[1] will be created
  + resource "aws_network_acl_rule" "public_inbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 110
      + to_port        = 443
    }

  # aws_network_acl_rule.public_inbound[2] will be created
  + resource "aws_network_acl_rule" "public_inbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 53
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "udp"
      + rule_action    = "allow"
      + rule_number    = 800
      + to_port        = 53
    }

  # aws_network_acl_rule.public_inbound[3] will be created
  + resource "aws_network_acl_rule" "public_inbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + icmp_code      = -1
      + icmp_type      = 8
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "icmp"
      + rule_action    = "allow"
      + rule_number    = 820
    }

  # aws_network_acl_rule.public_inbound[4] will be created
  + resource "aws_network_acl_rule" "public_inbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 830
      + to_port        = 65535
    }

  # aws_network_acl_rule.public_inbound[5] will be created
  + resource "aws_network_acl_rule" "public_inbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "udp"
      + rule_action    = "allow"
      + rule_number    = 840
      + to_port        = 65535
    }

  # aws_network_acl_rule.public_inbound[6] will be created
  + resource "aws_network_acl_rule" "public_inbound" {
      + cidr_block     = "82.196.6.227/32"
      + egress         = false
      + from_port      = 22
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 300
      + to_port        = 22
    }

  # aws_network_acl_rule.public_inbound[7] will be created
  + resource "aws_network_acl_rule" "public_inbound" {
      + cidr_block     = "172.17.0.0/16"
      + egress         = false
      + from_port      = 25
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 310
      + to_port        = 25
    }

  # aws_network_acl_rule.public_outbound[0] will be created
  + resource "aws_network_acl_rule" "public_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 80
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 80
    }

  # aws_network_acl_rule.public_outbound[1] will be created
  + resource "aws_network_acl_rule" "public_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 110
      + to_port        = 443
    }

  # aws_network_acl_rule.public_outbound[2] will be created
  + resource "aws_network_acl_rule" "public_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 53
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "udp"
      + rule_action    = "allow"
      + rule_number    = 800
      + to_port        = 53
    }

  # aws_network_acl_rule.public_outbound[3] will be created
  + resource "aws_network_acl_rule" "public_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 123
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "udp"
      + rule_action    = "allow"
      + rule_number    = 810
      + to_port        = 123
    }

  # aws_network_acl_rule.public_outbound[4] will be created
  + resource "aws_network_acl_rule" "public_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + icmp_code      = -1
      + icmp_type      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "icmp"
      + rule_action    = "allow"
      + rule_number    = 820
    }

  # aws_network_acl_rule.public_outbound[5] will be created
  + resource "aws_network_acl_rule" "public_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 830
      + to_port        = 65535
    }

  # aws_network_acl_rule.public_outbound[6] will be created
  + resource "aws_network_acl_rule" "public_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "udp"
      + rule_action    = "allow"
      + rule_number    = 840
      + to_port        = 65535
    }

  # aws_network_acl_rule.public_outbound[7] will be created
  + resource "aws_network_acl_rule" "public_outbound" {
      + cidr_block     = "172.17.0.0/16"
      + egress         = true
      + from_port      = 22
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 300
      + to_port        = 22
    }

  # aws_network_acl_rule.public_outbound[8] will be created
  + resource "aws_network_acl_rule" "public_outbound" {
      + cidr_block     = "172.17.0.0/16"
      + egress         = true
      + from_port      = 25
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 320
      + to_port        = 25
    }

  # aws_network_acl_rule.public_outbound[9] will be created
  + resource "aws_network_acl_rule" "public_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 587
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 330
      + to_port        = 587
    }

  # aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-private"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all         = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-private"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-public"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all         = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-public"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.database[0] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.database[1] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.database[0] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.12.0/25"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-db-us-east-1a"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all                                       = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-db-us-east-1a"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.database[1] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.12.128/25"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-db-us-east-1b"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all                                       = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-db-us-east-1b"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.11.0/25"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-private-us-east-1a"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all                                       = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-private-us-east-1a"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.10.0/25"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-public-us-east-1a"
          + "Project"     = "Lecture"
          + "Role"        = "public"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all                                       = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-public-us-east-1a"
          + "Project"     = "Lecture"
          + "Role"        = "public"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.10.128/25"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-public-us-east-1b"
          + "Project"     = "Lecture"
          + "Role"        = "public"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all                                       = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC-public-us-east-1b"
          + "Project"     = "Lecture"
          + "Role"        = "public"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.17.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all                             = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-VPC"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
    }

Plan: 67 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + azs                                         = [
      + "us-east-1a",
      + "us-east-1b",
    ]
  + cgw_arns                                    = []
  + cgw_ids                                     = []
  + database_nat_gateway_route_ids              = []
  + database_network_acl_arn                    = (known after apply)
  + database_network_acl_id                     = (known after apply)
  + database_route_table_association_ids        = [
      + (known after apply),
      + (known after apply),
    ]
  + database_route_table_ids                    = (known after apply)
  + database_subnet_arns                        = [
      + (known after apply),
      + (known after apply),
    ]
  + database_subnet_group                       = (known after apply)
  + database_subnet_group_name                  = "test-dev-db-group"
  + database_subnets                            = [
      + (known after apply),
      + (known after apply),
    ]
  + database_subnets_cidr_blocks                = [
      + "172.17.12.0/25",
      + "172.17.12.128/25",
    ]
  + database_subnets_ipv6_cidr_blocks           = []
  + default_network_acl_id                      = (known after apply)
  + default_route_table_id                      = (known after apply)
  + default_security_group_id                   = (known after apply)
  + elasticache_route_table_association_ids     = []
  + elasticache_route_table_ids                 = (known after apply)
  + elasticache_subnet_arns                     = []
  + elasticache_subnets                         = []
  + elasticache_subnets_cidr_blocks             = []
  + elasticache_subnets_ipv6_cidr_blocks        = []
  + igw_arn                                     = (known after apply)
  + igw_id                                      = (known after apply)
  + intra_route_table_association_ids           = []
  + intra_route_table_ids                       = []
  + intra_subnet_arns                           = []
  + intra_subnets                               = []
  + intra_subnets_cidr_blocks                   = []
  + intra_subnets_ipv6_cidr_blocks              = []
  + name                                        = "test-dev-VPC"
  + nat_ids                                     = [
      + (known after apply),
    ]
  + nat_public_ips                              = [
      + (known after apply),
    ]
  + natgw_ids                                   = [
      + (known after apply),
    ]
  + outpost_subnet_arns                         = []
  + outpost_subnets                             = []
  + outpost_subnets_cidr_blocks                 = []
  + outpost_subnets_ipv6_cidr_blocks            = []
  + private_ipv6_egress_route_ids               = []
  + private_nat_gateway_route_ids               = [
      + (known after apply),
    ]
  + private_network_acl_arn                     = (known after apply)
  + private_network_acl_id                      = (known after apply)
  + private_route_table_association_ids         = [
      + (known after apply),
    ]
  + private_route_table_ids                     = [
      + (known after apply),
    ]
  + private_subnet_arns                         = [
      + (known after apply),
    ]
  + private_subnets                             = [
      + (known after apply),
    ]
  + private_subnets_cidr_blocks                 = [
      + "172.17.11.0/25",
    ]
  + private_subnets_ipv6_cidr_blocks            = []
  + public_internet_gateway_route_id            = (known after apply)
  + public_network_acl_arn                      = (known after apply)
  + public_network_acl_id                       = (known after apply)
  + public_route_table_association_ids          = [
      + (known after apply),
      + (known after apply),
    ]
  + public_route_table_ids                      = [
      + (known after apply),
    ]
  + public_subnet_arns                          = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets                              = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets_cidr_blocks                  = [
      + "172.17.10.0/25",
      + "172.17.10.128/25",
    ]
  + public_subnets_ipv6_cidr_blocks             = []
  + redshift_public_route_table_association_ids = []
  + redshift_route_table_association_ids        = []
  + redshift_route_table_ids                    = [
      + (known after apply),
    ]
  + redshift_subnet_arns                        = []
  + redshift_subnets                            = []
  + redshift_subnets_cidr_blocks                = []
  + redshift_subnets_ipv6_cidr_blocks           = []
  + this_customer_gateway                       = {}
  + vpc_arn                                     = (known after apply)
  + vpc_cidr_block                              = "172.17.0.0/16"
  + vpc_enable_dns_hostnames                    = true
  + vpc_enable_dns_support                      = true
  + vpc_flow_log_destination_type               = "cloud-watch-logs"
  + vpc_id                                      = (known after apply)
  + vpc_instance_tenancy                        = "default"
  + vpc_ipv6_association_id                     = (known after apply)
  + vpc_ipv6_cidr_block                         = (known after apply)
  + vpc_main_route_table_id                     = (known after apply)
  + vpc_owner_id                                = (known after apply)
  + vpc_secondary_cidr_blocks                   = []

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group for test-dev"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "test-dev-external-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-external-sg"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all               = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-external-sg"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + vpc_id                 = "vpc-fake-id"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # aws_security_group_rule.egress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress Rule"
      + from_port                = -1
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "10.1.0.0/16",
        ]
      + description              = "HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "82.196.6.227/32",
        ]
      + description              = "ITSyndicate"
      + from_port                = -1
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "ingress"
    }

  # aws_security_group_rule.ingress_with_cidr_blocks[1] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "52.71.119.166/32",
        ]
      + description              = "Ingress Rule"
      + from_port                = -1
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "icmp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "ingress"
    }

  # aws_security_group_rule.ingress_with_cidr_blocks[2] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Ingress Rule"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # aws_security_group_rule.ingress_with_cidr_blocks[3] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Rule for HTTPS access"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.ingress_with_cidr_blocks[4] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Rule for HTTP access"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + security_group_arn         = (known after apply)
  + security_group_description = "Security group for test-dev"
  + security_group_id          = (known after apply)
  + security_group_name        = (known after apply)
  + security_group_owner_id    = (known after apply)
  + security_group_vpc_id      = "vpc-fake-id"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2_instance["1"].aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0ea1c7db66fee3098"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "jbCISTmpRole"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t4g.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "jb-itsyndicate_setup_only"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-priv"
      + tags                                 = {
          + "Name" = "test-dev-app-1"
          + "Role" = "app"
        }
      + tags_all                             = {
          + "Name" = "test-dev-app-1"
          + "Role" = "app"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-fake-id",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = {
              + "Name" = "test-dev-app-root"
            }
          + throughput            = 125
          + volume_id             = (known after apply)
          + volume_size           = 100
          + volume_type           = "gp3"
        }

      + timeouts {}
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + instance_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2_instance.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0ea1c7db66fee3098"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3a.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "jb-itsyndicate_setup_only"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-fake"
      + tags                                 = {
          + "Name" = "test-dev-bastion"
          + "Role" = "bastion"
        }
      + tags_all                             = {
          + "Name" = "test-dev-bastion"
          + "Role" = "bastion"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-fake-id",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = {
              + "Name" = "test-dev-bastion-root"
            }
          + throughput            = 125
          + volume_id             = (known after apply)
          + volume_size           = 80
          + volume_type           = "gp3"
        }

      + timeouts {}
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.this will be created
  + resource "aws_lb" "this" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "test-dev-alb"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-fake-id",
        ]
      + subnets                                     = (known after apply)
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.front_https will be created
  + resource "aws_lb_listener" "front_https" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:us-east-1:448058496623:certificate/03cca9c6-df8a-41ee-af4a-0dfe89705c55"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.this will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "test-dev-TG"
      + port                               = 8443
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTPS"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-tg"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all                           = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-tg"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc_id"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 50
          + matcher             = "200"
          + path                = "/jbilling/login/auth"
          + port                = "traffic-port"
          + protocol            = "HTTPS"
          + timeout             = 30
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = true
          + type            = "lb_cookie"
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

Results for commit: 148d276c2bb33d00a8a829e4cfbac237d8b028e3

*Pusher: @dmytro-its, Action: `pull_request`, Working Directory: `terragrunt/dev`, Workflow: `Terragrunt CI/CD Pipeline`*